#+TITLE: ML Floating-Point Formats in HDF5
#+DATE: [2020-08-19 Wed]

#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:C :flags "-I./src"


*** A simple test

#+begin_src C :noweb yes :tangle src/fmb.c :results silent

#include "fmb.h"

<<fmb-tail>>

<<fp16-tail>>
<<bfloat16-tail>>
<<tf32-tail>>
<<fp24-tail>>

int main(int argc, char** argv)
{
  hid_t file = H5Fcreate("float_my_boat.h5", H5F_ACC_TRUNC,
                         H5P_DEFAULT, H5P_DEFAULT);

  hid_t dtype = make_fp16();
  H5Tcommit(file, "fp16", dtype, H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
  H5Tclose(dtype);
  dtype = make_bfloat16();
  H5Tcommit(file, "bfloat16", dtype, H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
  H5Tclose(dtype);
  dtype = make_tf32();
  H5Tcommit(file, "tf32", dtype, H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
  H5Tclose(dtype);
  dtype = make_fp24();
  H5Tcommit(file, "fp24", dtype, H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
  H5Tclose(dtype);

  H5Fclose(file);
  return 0;
}

#+end_src

#+begin_src sh :results output
h5ls -v float_my_boat.h5
#+end_src

#+begin_src sh :results output
h5dump float_my_boat.h5
#+end_src

#+RESULTS:
: HDF5 "float_my_boat.h5" {
: GROUP "/" {
:    DATATYPE "bfloat16" 16-bit little-endian floating-point;
:    DATATYPE "fp16" 16-bit little-endian floating-point;
:    DATATYPE "fp24" 24-bit little-endian floating-point;
:    DATATYPE "tf32" 24-bit little-endian floating-point;
: }
: }

